<?php

namespace View;

class home {

  public function boot(){
    return "\xF0\x9F\x8D\x9F به ربات هوشمند و پیشرفته فروش شماره مجازی اتومات رز نامبر خوش آمدید.\n
    \xF0\x9F\x91\x88 \t فروش شماره های مجازی از کشورهای انگلیس , آمریکا , مالزی , اندونزی , روسیه , چین , فیلیپین , ویتنام و ... می باشد. \n
    \xF0\x9F\x91\x88 \t برای نرم افزار های شبکه اجتماعی تلگرام , وایبر , واتس آپ , اینستاگرام و ایمو قایل ارائه می باشد. \n
    \xE2\x80\xBC \t توجه کنید : برای تمام نرم افزار ها و از تمام کشور ها کد فعال سازی فقط یکبار ارسال میشود. \n
    \xF0\x9F\x91\x88 \t با معرفی ربات به دوستان خود از بخش زیر مجموعه گیری بیست درصد از فروش هر شماره مجازی به موجودی شما اضافه می گردد. \n
    \xF0\x9F\x91\x88 \t مسئولیت سواستفاده و ایجاد مزاحمت از این شماره ها به عهده خریدار است.";
  }

  public function support($data){
    return "\xF0\x9F\x8D\x9F پشتیبانی \n
    \xF0\x9F\x92\xAC در چه مواردی پاسخگو هستیم \n
    \xF0\x9F\x91\x88 گزارش باگ \n
    \xF0\x9F\x91\x88 درخواست ساخت ربات \n
    \xF0\x9F\x91\x88 مشکل در پرداخت \n
    \xF0\x9F\x90\x99 برای ارسال درخواست یا گزارش خود به این ای دی پیام بدهید \n
    \xF0\x9F\x86\x94 {$data->supportId}";
  }

  public function price(){
    return "\xF0\x9F\x8D\x9F خرید شماره مجازی \n
    \xF0\x9F\x92\xAC قوانین رز نامبر \n
    \xF0\x9F\x91\x88 \t ربات رز نامبر تنها شماره مجازی و کد پیامک شده را ارائه می دهد و مسئولیت محدودیت های اکانت ساخته شده توسط اپلیکیشن ها بر عهده خریدار است. \n
    \xF0\x9F\x91\x88 \t با توجه به اینکه شماره ها مستقیما از پنل های خارجی دریافت می شود و ربات رز نامبر تنها واسط بین کاربر و پنل است امکان بررسی شماره ها توسط ما امکان پذیر نیست. \n
    \xF0\x9F\x91\x88 \t به همین علت گاها ممکن است بعد از ارسال کد اکانتی از قبل توسط شماره موردنظر در اپلیکیشن مورد نظرتان خصوصا تلگرام فعال باشد. \n
    \xF0\x9F\x91\x88 \t تنها راه حل برای جلوگیری از بروز این مشکل چک کردن شماره مجازی قبل از دریافت کد است \r برای تلگرام اگر شماره ثبت شده باشد بلافاصله با وارد کردن شماره در تلگرام پیغام ارسال کد فعال دیگر نمایش داده می شود و مانند شماره های ریجستر نشده نیست.";
  }

  public function subset($data){
    return "\xF0\x9F\x8D\x9F زیرمجموعه گیری \n
    \xF0\x9F\x91\x88 \t با وارد شدن هر کاربر جدید با لینک زیر مجموعه گیری شما در ربات رز نامبر به صورت آنی مبلغ دویست تومان به اعتبار شما اضافه می گردد \n
    \xF0\x9F\x91\x88 \t همچنین در صورتی ک زیر مجموعه شما موجودی حساب خود را افزایش دهد بیست درصد از مبلغ هر بار افزایش موجودی زیرمجموعه تان به شما تعلق میگیرد. \n
    \xF0\x9F\x90\x99 \t لینک اختصاصی شما \n\n https://telegram.me/{$data->robat}?start={$data->userId}";
  }

  public function help(){
    return "\xF0\x9F\x8D\x9F راهنمای ربات \n
    \xF0\x9F\x91\x88 \t شما با استفاده از این ربات هوشمند شماره مجازی کشور های مختلف را به صورت ارزان خریداری می کنید. \n
    \xF0\x9F\x91\x88 \t تمام روند خرید و دریافت شماره و ثبت نام در برنامه مورد نظر کاملا  اتوماتیک انجام می شود. \n
    \xF0\x9F\x91\x88 \t با کمترین هزینه ممکن در سریع ترین زمان و امن ترین حالت ممکن شماره مجازی خود را خریداری نمایید. \n
    \xF0\x9F\x91\x88 \t در صورت بروز هرگونه مشکل یا سوال با کلیک بر روی دکمه پشتیبانی در منوی اصلی با ما ارتباط برقرار نمایید. \n
    \xE2\x80\xBC \t از منو های زیر جهت راهنمایی استفاده کنید. ";
  }

  public function Q1(){
    return "\xF0\x9F\x8D\x9F راهنمای ربات \n
    \xF0\x9F\x92\xAC شماره مجازی چیست \n
    \xF0\x9F\x91\x88 \t هنگام ثبت نام در اپلیکیشن های پیام رسان و شبکه های اجتماعی موبایل باید از شماره تلفن خود به عنوان شناسه استفاده کنید. \n
    اگر از کاربرانی هستید ک علاقه ای به اشتراک گذاری شماره اصلی خود ندارید یا اینکه نیاز به ثبت نام بیش از یک بار در این برنامه دارید. \n
    می توانید از شماره های مجازی استفاده کنید. \r همچنین شماره مجازی این امکان را می دهد ک بدون ثبت سیم کارت و اهراز هویت و بدون صرف وقت و هزینه صاحب شماره از کشور های مختلف شوید. \n
    \xF0\x9F\x92\xAC مزایا و کاربرد شماره مجازی \n
    \xF0\x9F\x91\x88 \t بسیاری از افراد به دلایل مختلف مانند مدیریت یک اکانت دیگر برای مباحث کاری و ... نیاز به اکانت دوم دارند تا بتوانند در عین ارتباط داشتن \r با مشتریان خود از تلگرام شخصی و خصوصی خود نیز استفاده کنند. \n
    \xF0\x9F\x91\x88 \t بدون ثبت نام در اپراتور و بدون صرف وقت و هزینه و اهراز هویت صاحب شماره مجازی می شوید . \n
    \xF0\x9F\x91\x88 \t  استفاده در تمامی اپلیکیشن های اجتماعی با شماره از کشورهای مختلف! ";
  }

  public function Q2(){
    return "\xF0\x9F\x8D\x9F راهنمای ربات \n
    \xF0\x9F\x91\x88 \t بر روی مبلغ دلخواه خود کلیک کنید سپس به صفحه پرداخت هدایت می شوید و پس از پرداخت وجه به صورت اتوماتیک حساب کاربری شما شارژ میشود. \n";
  }

  public function profile($data){
    return "\xF0\x9F\x8D\x9F حساب کاربری شما \n
    \xF0\x9F\x91\x88 \t نام شما : {$data->user->name} \n
    \xF0\x9F\x91\x88 \t یوزرنیم : {$data->user->username} \n
    \xF0\x9F\x91\x88 \t آیدی : {$data->user->id} \n
    \xF0\x9F\x91\x88 \t موجودی : ".number_format($data->user->cash, 0)." تومان  \n
    \xF0\x9F\x92\xAC \t به ازای معرفی هر یک زیر مجموعه دویست تومان دریافت کنید. \n
    \xF0\x9F\x91\x88 \t زیر مجموعه ها : {$data->user->subset} نفر \n
    \xF0\x9F\x91\x88 \t تعداد شماره های خریداری شده : {$data->user->nums} ";
  }

  public function charge($data){
    return "\xF0\x9F\x8D\x9F شارژ حساب کاربری \n
    \xF0\x9F\x91\x88 \t بر روی مبلغ دلخواه خود کلیک کنید سپس به صفحه پرداخت هدایت می شوید و پس از پرداخت وجه به صورت اتوماتیک حساب کاربری شما شارژ میشود. \n";
  }

  public function inquiry(){
   return "\xF0\x9F\x8D\x9F لیست برنامه ها \n
   \xF0\x9F\x91\x88 \t استعلام شماره ها هر ده دقیقه یک بار بروز می شود. \n
   \xF0\x9F\x91\x88 \t شماره ها به طور مداوم در حال شارژ شدن هستند. \n
   \xF0\x9F\x91\x88 \t سرویس یا اپلیکیشن مورد نظر خود را انتخاب کنید";
  }

  public function program(){
    return "\xF0\x9F\x8D\x9F انتخاب سرویس یا اپلیکشین \n
    \xF0\x9F\x91\x88 \t لطفا یکی از سرویس ها یا اپلیکشین های زیر را انخاب ";
  }

  public function country(){
    return "\xF0\x9F\x8D\x9F انتخاب سرویس یا اپلیکشین \n
    \xF0\x9F\x91\x88 \t لطفا یکی از کشور های زیر را انتخاب کنید \n
    \xF0\x9F\x91\x88 \t پیشنهادی : تایلند ... انگلیس ... ماداگاسکار ... هنگ کنگ ... ویتنام ... میانمار";
  }

  public function getNum($data){
    return "\xF0\x9F\x8D\x9F خرید شماره مجازی \n
    \xF0\x9F\x92\xAC ابتدا شماره را جهت ثبت نام در اپلیکیشن مورد نظر وارد نمایید. سپس بعد از دو دقیقه برای دریافت کد کلیک کنید. \n
    \xF0\x9F\x91\x88 کشور : \r {$data->country} \n
    \xF0\x9F\x91\x88 اپلیکیشن : \r {$data->app} \n
    \xF0\x9F\x91\x88 قیمت : \r ".number_format($data->amount, 0)." تومان \n
    \xF0\x9F\x92\xAC برای جلوگیری از وجود داشتن شماره ثبت شده لطفا شماره را قبل از زدن کد در اپلیکیشن چک نمایید. \n
    \xF0\x9F\x8E\x81 شماره شما ساخته شد \n\n {$data->number}";
  }

  public function getCodeOne($data){
    return "\xF0\x9F\x8D\x9F خرید شماره مجازی \n
    \xF0\x9F\x92\xAC ده ثانیه صبر کنید و مجددا بر روی دریافت کد بزنید. \n
    \xF0\x9F\x91\x88 کشور : \r {$data->country} \n
    \xF0\x9F\x91\x88 اپلیکیشن : \r {$data->app} \n
    \xF0\x9F\x91\x88 قیمت : \r {$data->amount} تومان \n
    \xE2\x99\xBB وضعیت دریافت کد : در انتظار ارسال اس ام اس \n
    \xF0\x9F\x92\xAC تنها پنج دقیقه پس از زمان دریافت شماره فرصت دارید تا کد را دریافت کنید. \n
    \xF0\x9F\x92\xAC اگر زمان از پنج دقیقه گذشت انصراف را بزنید و شماره دیگری دریافت کنید. \n
    \xF0\x9F\x8E\x81 شماره ساخته شده \n\n {$data->number} ";
  }

  public function getCodeTwo($data){
    return "\xF0\x9F\x8D\x9F خرید شماره مجازی \n
    \xF0\x9F\x92\xAC ده ثانیه صبر کنید و مجددا بر روی دریافت کد بزنید. \n
    \xF0\x9F\x91\x88 کشور : \r {$data->country} \n
    \xF0\x9F\x91\x88 اپلیکیشن : \r {$data->app} \n
    \xF0\x9F\x91\x88 قیمت : \r {$data->amount} تومان \n
    \xE2\x99\xBB وضعیت دریافت کد : کد دریافت شد \n
    \xF0\x9F\x92\xAC تنها پنج دقیقه پس از زمان دریافت شماره فرصت دارید تا کد را دریافت کنید. \n
    \xF0\x9F\x92\xAC اگر زمان از پنج دقیقه گذشت انصراف را بزنید و شماره دیگری دریافت کنید. \n
    \xF0\x9F\x8E\x81 شماره ساخته شده \n\n {$data->number} \n
    \xE2\x99\xBB کد دریافت شد \n ==| {$data->code} |=";
  }

  public function payment(){
    return "\xF0\x9F\x8D\x9F شارژ حساب کاربری \n
    \xF0\x9F\x91\x88 \t بر روی دکمه پرداخت کلیک کنید تا به درگاه پرداخت هدایت شوید . پس از پرداخت مبلغ موردنظر به ربات باز میگردید و حساب کاربری شما شارژ خواهد شد . سپس می توانید از دکمه خرید شماره مجازی , شماره مورد نظر خود را  خریداری نمایید.";
  }

  public function sendMsgChannel($data){
    return "\xF0\x9F\x92\xAC یک عدد شمار مجازی {$data->country} خریداری شد \n
    \xF0\x9F\x8D\x9F اطلاعات شماره و خریدار \n
    \xE2\x98\x8E \t Number :\t {$data->gnum} \n
    \xF0\x9F\x8E\x84 \t App :\t {$data->app} \n
    \xF0\x9F\x91\xA4 \t User :\t {$data->userId} \n\n \xF0\x9F\x92\xAC روش خرید و دریافت شماره مجازی \n
    \xF0\x9F\x91\x88 وارد ربات {$data->robatId} شوید. \n
    \xF0\x9F\x91\x88 اعتبار خود را {$data->amount} تومان افزایش دهید. \n
    \xF0\x9F\x91\x88 شماره مجازی {$data->country} دریافت کنید! \n\n".
    "\xF0\x9F\x8D\xB7 شماره های مجازی ثبت نشده هستند و با متد های اتومات توسط کاربران ربات رز نامبر به صورت کاملا خودکار دریافت و ثبت می شوند. \n\n".
    "\xF0\x9F\x8D\xB7 این پیام خودکار با دریافت کد شماره مجازی توسط کاربر ربات رز نامبر ارسال شده است. \n\n \xF0\x9F\x90\x99 {$data->robatId} ";
  }

  public function notfoundNumber(){
    return "\xF0\x9F\x8D\x9F خرید شماره مجاز \n
    \xF0\x9F\x91\x88 \t متاسفانه در حال حاظر برای این کشور و اپلیکیشن شماره ای در دسترس نمی باشد. به زودی موجود خواهد شد . میتوانید چند دقیقه دیگر امتحان کنید و یا کشور دیگری را انتخاب کن";
  }

  public function chargeTwo($data){
    return "\xF0\x9F\x8D\x9F شارژ حساب کاربری \n
    \xF0\x9F\x92\xAC \t موجودی شما از بهای شماره مجازی کمتر است. جهت افزایش موجودی بر روی شارژ حساب کلیک کنید. پس از شارژ حساب جهت خرید شماره مجازی اقدام نمایید. \n
    \xF0\x9F\x91\x88 کشور : \r {$data->country} \n
    \xF0\x9F\x91\x88 اپلیکیشن : \r {$data->app} \n
    \xF0\x9F\x91\x88 قیمت : \r {$data->amount} تومان \n
    \xF0\x9F\x91\x88 موجودی شما : \r {$data->cash} تومان \n";
  }

  public function chargeErr(){
    return "\xF0\x9F\x8D\x9F شارژ حساب کاربری \n
    \xF0\x9F\x92\xAC افزایش شارژ یا خطا مواجه شد. اگر پولی از حساب شما کسر شده است طی 24 ساعت اینده به حساب شما بازمیگردد \n
    برای تلاش مجدد یکی از گزینه های زیر را انتخاب کنید";
  }

  public function chargeSuc($data){
    return "\xF0\x9F\x8D\x9F شارژ حساب کاربری \n
    \xF0\x9F\x92\xAC شارژ با موفقیت انجام شد .\n
    مبلغ شارژ : ".number_format($data->amount, 0)." تومان \n\n کل موجودی شما : ".number_format($data->cash, 0)." تومان \n\n شماره تراکنش : {$data->transId}";
  }

}
